import 'package:simkart/utilis/bundle_model.dart';

class Salaam {
  static List<BundleModel> salnetmonth = [
    BundleModel(
      'بسته 1 جی بی ماهانه',
      "1 جی بی",
      "یک ماه",
      "92 افغانی",
      '  برای فعالسازی "A 1GB" را  به 740  بفرستید.',
      'برای غیرفعالسازی "D 1GB" را  به 740  بفرستید.',
      '740',
      'A 1GB',
      '740',
      'D 1GB',
    ),
    BundleModel(
      'بسته 3 جی بی ماهانه',
      "3 جی بی",
      "یک ماه",
      "184 افغانی",
      '  برای فعالسازی "A 3GB" را  به 740  بفرستید.',
      'برای غیرفعالسازی "D 3GB" را  به 740  بفرستید.',
      '740',
      'A 3GB',
      '740',
      'D 3GB',
    ),
    BundleModel(
      'بسته 5 جی بی ماهانه',
      "5 جی بی",
      "یک ماه",
      "276 افغانی",
      '  برای فعالسازی "A 5GB" را  به 740  بفرستید.',
      'برای غیرفعالسازی "D 5GB" را  به 740  بفرستید.',
      '740',
      'A 5GB',
      '740',
      'D 5GB',
    ),
    BundleModel(
      'بسته 10 جی بی ماهانه',
      "10 جی بی",
      "یک ماه",
      "415 افغانی",
      '  برای فعالسازی "A 10GB" را  به 740  بفرستید.',
      'برای غیرفعالسازی "D 10GB" را  به 740  بفرستید.',
      '740',
      'A 10GB',
      '740',
      'D 10GB',
    ),
    BundleModel(
        'بسته 30 جی بی ماهانه',
        "30 جی بی",
        "یک ماه",
        "1200 افغانی",
        '  برای فعالسازی "A 30GB" را  به 740  بفرستید.',
        'برای غیرفعالسازی "D 30GB" را  به 740  بفرستید.',
        '740',
        'A 30GB',
        '740',
        'D 30GB',
        'شما هر روز 1 جی بی دریافت خواهید کرد برای سی روز'),
    BundleModel(
      'بسته 50 جی بی ماهانه',
      "50 جی بی",
      "یک ماه",
      "1499 افغانی",
      '  برای فعالسازی "A 50GB" را  به 740  بفرستید.',
      'برای غیرفعالسازی "D 50GB" را  به 740  بفرستید.',
      '740',
      'A 50GB',
      '740',
      'D 50GB',
    ),
  ];
  static List<BundleModel> salnetweek = [
    BundleModel(
        'بسته 250 ام بی برای دو هفته',
        "250 ام بی",
        "دو هفته",
        "28 افغانی",
        '  برای فعالسازی "A 250MB" را  به 740  بفرستید.',
        'برای غیرفعالسازی "D 250MB" را  به 740  بفرستید.',
        '740',
        'A 250MB',
        '740',
        'D 250MB'),
  ];
  static List<BundleModel> salnetday = [
    BundleModel(
        'بسته 100 ام بی روزانه',
        "100 ام بی",
        "یک روز",
        "10 افغانی",
        '  برای فعالسازی "A 100MB" را  به 740  بفرستید.',
        'برای غیرفعالسازی "D 100MB" را  به 740  بفرستید.',
        '740',
        'A 100MB',
        '740',
        'D 100MB'),
    BundleModel(
        'بسته 1 جی بی روزانه',
        "1 جی بی",
        "یک روز",
        "49 افغانی",
        '  برای فعالسازی "A 49" را  به 740  بفرستید.',
        'برای غیرفعالسازی "D 49" را  به 740  بفرستید.',
        '740',
        'A 49',
        '740',
        'D 49'),
  ];
  static List<BundleModel> salnethour = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salnetnight = [
    BundleModel(
        'بسته 1 جی بی برای هفت شب',
        "1 جی بی",
        "هفت شب",
        "50 افغانی",
        '  برای فعالسازی "A SML" را  به 740  بفرستید.',
        'برای غیرفعالسازی "D SML" را  به 740  بفرستید.',
        '740',
        'A SML',
        '740',
        'D SML'),
    BundleModel(
        'بسته 2 جی بی برای سی شب',
        "2 جی بی",
        "سی شب",
        "90 افغانی",
        '  برای فعالسازی "A MDM" را  به 740  بفرستید.',
        'برای غیرفعالسازی "D MDM" را  به 740  بفرستید.',
        '740',
        'A MDM',
        '740',
        'D MDM'),
    BundleModel(
        'بسته 5 جی بی برای سی شب',
        "5 جی بی",
        "سی شب",
        "200 افغانی",
        '  برای فعالسازی "A LRG" را  به 740  بفرستید.',
        'برای غیرفعالسازی "D LRG" را  به 740  بفرستید.',
        '740',
        'A LRG',
        '740',
        'D LRG'),
    BundleModel(
        'بسته 10 جی بی برای سی شب',
        "10 جی بی",
        "سی شب",
        "350 افغانی",
        '  برای فعالسازی "A XTR" را  به 740  بفرستید.',
        'برای غیرفعالسازی "D XTR" را  به 740  بفرستید.',
        '740',
        'A XTR',
        '740',
        'D XTR'),
  ];
  static List<BundleModel> salnetmix = [
    BundleModel(
        'بسته میکس ماهانه',
        "3 جی بی+3000 دقیقه+پیام نامحدود",
        "یک ماه",
        "1000 افغانی",
        '  برای فعالسازی "A 1000" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 1000" را  به 741  بفرستید.',
        '741',
        'A 1000',
        '741',
        'D 1000',
        'پیام و تماس فقط سلام به سلام'),
    BundleModel(
        'بسته میکس ماهانه',
        "1 جی بی+1000 دقیقه+پیام نامحدود",
        "یک ماه",
        "500 افغانی",
        '  برای فعالسازی "A 1000" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 1000" را  به 741  بفرستید.',
        '741',
        'A 1000',
        '741',
        'D 1000',
        '50 دقیقه تماس به شبکه های دیگر'),
  ];
  static List<BundleModel> salsmsmonth = [
    BundleModel(
        'بسته نامحدود پیام ماهانه',
        "نامحدود",
        "یک ماه",
        "50 افغانی",
        '  برای فعالسازی "A UMS" را  به 740  بفرستید.',
        'غیر فعالسازی ندارد.',
        '740',
        'A UMS',
        null,
        null,
        'فقط سلام به سلام'),
  ];
  static List<BundleModel> salsmsweek = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salsmsday = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salsmshour = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salsmsnight = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salsmsmix = [
    BundleModel(
        'بسته میکس ماهانه',
        "3 جی بی+3000 دقیقه+پیام نامحدود",
        "یک ماه",
        "1000 افغانی",
        '  برای فعالسازی "A 1000" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 1000" را  به 741  بفرستید.',
        '741',
        'A 1000',
        '741',
        'D 1000',
        'پیام و تماس فقط سلام به سلام'),
    BundleModel(
        'بسته میکس ماهانه',
        "1 جی بی+1000 دقیقه+پیام نامحدود",
        "یک ماه",
        "500 افغانی",
        '  برای فعالسازی "A 1000" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 1000" را  به 741  بفرستید.',
        '741',
        'A 1000',
        '741',
        'D 1000',
        '50 دقیقه تماس به شبکه های دیگر'),
  ];
  static List<BundleModel> saltelmonth = [
    BundleModel(
      'بسته 1500 دقیقه تماس ماهانه',
      "1500 دقیقه",
      "یک ماه",
      "300 افغانی",
      '  برای فعالسازی "A 1500" را  به 740  بفرستید.',
      'برای غیرفعالسازی "D 1500" را  به 740  بفرستید.',
      '740',
      'A 1500',
      '740',
      'D 1500',
    ),
  ];
  static List<BundleModel> saltelweek = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> saltelday = [
    BundleModel(
        'بسته 60 دقیقه تماس ماهانه',
        "60 دقیقه",
        "یک روز",
        "20 افغانی",
        '  برای فعالسازی "A 20" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 20" را  به 741  بفرستید.',
        '741',
        'A 20',
        '741',
        'D 20'),
    BundleModel(
        'بسته 100 دقیقه تماس ماهانه',
        "100 دقیقه",
        "یک روز",
        "30 افغانی",
        '  برای فعالسازی "A 30" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 30" را  به 741  بفرستید.',
        '741',
        'A 30',
        '741',
        'D 30'),
    BundleModel(
        'بسته 200 دقیقه تماس ماهانه',
        "200 دقیقه",
        "یک روز",
        "50 افغانی",
        '  برای فعالسازی "A 50" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 50" را  به 741  بفرستید.',
        '741',
        'A 50',
        '741',
        'D 50'),
  ];
  static List<BundleModel> saltelhour = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> saltelnight = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> saltelmix = [
    BundleModel(
        'بسته میکس ماهانه',
        "3 جی بی+3000 دقیقه+پیام نامحدود",
        "یک ماه",
        "1000 افغانی",
        '  برای فعالسازی "A 1000" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 1000" را  به 741  بفرستید.',
        '741',
        'A 1000',
        '741',
        'D 1000',
        'پیام و تماس فقط سلام به سلام'),
    BundleModel(
        'بسته میکس ماهانه',
        "1 جی بی+1000 دقیقه+پیام نامحدود",
        "یک ماه",
        "500 افغانی",
        '  برای فعالسازی "A 1000" را  به 741  بفرستید.',
        'برای غیرفعالسازی "D 1000" را  به 741  بفرستید.',
        '741',
        'A 1000',
        '741',
        'D 1000',
        '50 دقیقه تماس به شبکه های دیگر'),
  ];
  static List<BundleModel> salnatiomonth = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salnatioweek = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salnatioday = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salnatiohour = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salnationight = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
  static List<BundleModel> salnatiomix = [
    BundleModel('بسته ای موجود نیست', '.', '.', '.', '', ''),
  ];
}
